Tekla Open API Reference for Tekla Structures 2025
FinishItem.ToString Method
Returns the fully qualified type name of this instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The fully qualified type name.
See Also
Reference
FinishItem Structure
Tekla.Structures.Catalogs Namespace